Documentation/Tasks-Gantt_Chart.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Task List and Gantt Chart Usage</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Percy" />
<meta  name="description" content="Zambia is a piece of Con Management Software.  This document is a &quot;How To&quot; guide to help set up your Zambia FFF-branch instance from scratch for your convention.  This is still a work in progress."
 />
<meta  name="keywords" content="Zambia, Documentation, FFF branch" />
</head>
<body>
<div id="content">
<h1 class="title">Task List and Gantt Chart Usage</h1>
<p>

</p>
<p>
Task List and Gantt Chart Usage
</p>
<p>
Percy &lt;NELA.Percy@gmail.com&gt;
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. My Task List</a></li>
<li><a href="#sec-3">3. This Events Task List</a></li>
<li><a href="#sec-4">4. All Tasks</a></li>
<li><a href="#sec-5">5. Task List Update</a></li>
<li><a href="#sec-6">6. New Task</a></li>
<li><a href="#sec-7">7. Task Replication</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The Task List and the <a href="http://en.wikipedia.org/wiki/Gantt_chart">Gant Chart</a> are two important tools in running
your convention.  Zambia provides both with more emphasis on the
Task List but both are available for use.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> My Task List</h2>
<div class="outline-text-2" id="text-2">
<p>
The task list can be viewed in several different ways.  The easiest
way to start looking at it is to go to the Staff Overview page, find
the Dashboard, and click on the "Task List" link, and that will take
you to your tasks.  You might not have any tasks at this time,
which, if this is your first exposure to the task list, and you have
not had anyone else assigning tasks to you, is perfectly
understandable.  Also, across the top of the page are links to New
Task, This Event's Tasks, and All Tasks. If you do have tasks, there
will be several columns.  There is:
</p>
<ul class="org-ul">
<li>Tasks: the short name of the task, which is a clickable link to
the update page for that task.
</li>
<li>Notes: All information about that task, this field can have
standard HTML markup in it.
</li>
<li>Assigned: Should all be you.
</li>
<li>Start Date: When this task should be started by.
</li>
<li>Due Date: When this task should be completed by.
</li>
<li>Complete?: Shows the state of the task as one of, ("N", "P", "Y")
which map respectively to not started, partially done, and, yes it
is complete.
</li>
<li>Finished On: This is the date you clicked that it was finished.
</li>
</ul>
<p>
This report can also be found under:
genreport.php?reportname=mytasklistdisplay
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> This Events Task List</h2>
<div class="outline-text-2" id="text-3">
<p>
This report is findable in a number of ways.  It can be found under:
genreport.php?reportname=tasklistdisplay
and is in many of the departmental report lists, under the Available
Reports tab.  This is the list of all the tasks relevant to this
particular con instance.  Across the top it should have links to
create a new task, to your personal task list, to the Gantt Chart
for this event, and to all the tasks from all the cons.  There are
several columns to this report:
</p>
<ul class="org-ul">
<li>Tasks: the short name of the task, which is a clickable link to
the update page for that task.
</li>
<li>Notes: All information about that task, this field can have
standard HTML markup in it.
</li>
<li>Assigned: Who the task is assigned to, or who is the one person in
charge of making sure it is complete.
</li>
<li>Start Date: When this task should be started by.
</li>
<li>Due Date: When this task should be completed by.
</li>
<li>Complete?: Shows the state of the task as one of, ("N", "P", "Y")
which map respectively to not started, partially done, and, yes it
is complete.
</li>
<li>Finished On: This is the date that it was indicated that it was
finished. (Note, this might not be the actual finish date,
depending on how diligently people check their tasks.)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> All Tasks</h2>
<div class="outline-text-2" id="text-4">
<p>
This report is findable in a number of ways.  It can be found under:
genreport.php?reportname=alltasklistdisplay
and from the header of other task list reports.  This is mostly
useful for a look back at other task lists to see if tasks assigned
then are useful to replicate for tasks assigned now.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Task List Update</h2>
<div class="outline-text-2" id="text-5">
<p>
Most references to the task name can be clicked on, to allow you to
update the task.
The fields are:
</p>
<ul class="org-ul">
<li>Person assigned: a pull-down list of all the people you have
permission to assign to the task.  If the person assigned is not
you, nor someone you can assign tasks to, the chances are, you
should not be updating this task.  This will give you the "Outside
your assignment list" message in the "Person assigned:" box.
</li>
<li>Task: The task name (fixed)
</li>
<li>Note: This is where most of the updating goes, adding or changing
the "Note:" section of the task.  It can take standard HTML
markup.
</li>
<li>Dependencies: The "[update]" will take you to the add/drop page
for dependencies, and list the (clickable) dependencies already
associated with this task.
</li>
<li>Targeted Start Time: a RFC-standard date (YYYY-MM-DD) of when
activities on this task should start.
</li>
<li>Targeted Completion Time: a RFC-standard date (YYYY-MM-DD) of when
activities on this task should be done.
</li>
<li>The last field either will have the "Is it done?" with the
possible states of:
<ul class="org-ul">
<li>Yes, it is finished.
</li>
<li>It is partially done.
</li>
<li>It has not yet been begun.
</li>
</ul>
<p>
or the date upon which it was completed under a "Finished at:"
field.
</p>
</li>
<li>The "Update" button.
</li>
</ul>
<p>
It should be fairly straight-forward how to fill this out.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> New Task</h2>
<div class="outline-text-2" id="text-6">
<p>
This just takes you to a blank task list update form, so you can
fill out all the information.  The additional field is for the task
name, and you cannot set the completion state, or add dependencies
here.
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Task Replication</h2>
<div class="outline-text-2" id="text-7">
<p>
Future enhancement.  Nothing further at this time.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: July 2012</p>
<p class="author">Author: Percy</p>
<p class="email">Email: <a href="mailto:NELA.Percy@gmail.com">NELA.Percy@gmail.com</a></p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>